In [15]:
import pandas as pd #imporing pandas library as pd. This is a very important Library that we will be using at all times.

In [16]:
df = pd.read_csv("../data/gapminder.tsv", sep="\t") #reading the data set and storing it into a dataframe(df)
# here tsv means "Tab separated values", we will be denoting it with a attribute sep='\t'

In [18]:
pd.__version__  #gives the version

'0.24.2'

In [19]:
df.head()# used to get the top rows from a dataset

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [20]:
type(df)  # describes the TYPE of its attribute

pandas.core.frame.DataFrame

In [21]:
df.shape  #returns two values 
#--Number of rows and number of columns

(1704, 6)

In [22]:
df.columns #gives the column names present in the dataset

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [23]:
df.index  #returns the range of indices present in the dataframe--
#start: the indexing started at 0 and ended at stop:1704 with each step of one at a time

RangeIndex(start=0, stop=1704, step=1)

In [24]:
df.values  #returns a numpy array that stores each row of dataset separately,
#useful while iterating.

array([['Afghanistan', 'Asia', 1952, 28.801, 8425333, 779.4453145],
       ['Afghanistan', 'Asia', 1957, 30.331999999999997, 9240934,
        820.8530296],
       ['Afghanistan', 'Asia', 1962, 31.997, 10267083, 853.1007099999999],
       ...,
       ['Zimbabwe', 'Africa', 1997, 46.809, 11404948, 792.4499602999999],
       ['Zimbabwe', 'Africa', 2002, 39.989000000000004, 11926563,
        672.0386227000001],
       ['Zimbabwe', 'Africa', 2007, 43.486999999999995, 12311143,
        469.70929810000007]], dtype=object)

In [25]:
df.dtypes  #returns the datatypes of all attributes present in dataset

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [38]:
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [26]:
df.info()  #gives the total information regarding dataste
#like shape, number of Non Null values (missing values)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
country      1704 non-null object
continent    1704 non-null object
year         1704 non-null int64
lifeExp      1704 non-null float64
pop          1704 non-null int64
gdpPercap    1704 non-null float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [27]:
country_df = df[['country']]  #taking a specific column from dataframe and storing it in another variable.

In [28]:
country_df.head()

       country
0  Afghanistan
1  Afghanistan
2  Afghanistan
3  Afghanistan
4  Afghanistan

In [29]:
subset = df[['country', 'continent', 'year']] #column slicing separating required columns from dataset

In [30]:
subset.head()

       country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

In [39]:
df.loc[0] #gives info regarding the first row(0th row) from dataset

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap        779.445
Name: 0, dtype: object

In [40]:
df.loc[[0]] #if we want the details more like a table use the square braces

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314

In [43]:
df.iloc[[0]]  #we can even use this instead of loc

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314

In [31]:
subset = df.loc[:50, ['continent','year', 'pop']]  #returns 0 to  50 rows from given column attributes.

In [32]:
subset.head()

  continent  year       pop
0      Asia  1952   8425333
1      Asia  1957   9240934
2      Asia  1962  10267083
3      Asia  1967  11537966
4      Asia  1972  13079460

In [35]:
subset = df.iloc[:50, [1, 4]]#returns 0 to  50 rows from given column attribute's indeces.

In [36]:
subset.head()

  continent       pop
0      Asia   8425333
1      Asia   9240934
2      Asia  10267083
3      Asia  11537966
4      Asia  13079460

In [52]:
df.sample(10) #taking a sample set of 10 rows from dataframe

              country continent  year  lifeExp        pop     gdpPercap
199      Burkina Faso    Africa  1987   49.557    7586551    912.063142
306          Colombia  Americas  1982   66.653   27764644   4397.575659
1132          Nigeria    Africa  1972   42.821   53740085   1698.388838
1401          Somalia    Africa  1997   43.795    6633514    930.596428
1369  Slovak Republic    Europe  1957   67.450    3844277   6093.262980
1441            Sudan    Africa  1957   39.624    9753392   1770.337074
1478      Switzerland    Europe  1962   71.320    5666000  20431.092700
107        Bangladesh      Asia  2007   64.062  150448339   1391.253792
885           Lesotho    Africa  1997   55.558    1982823   1186.147994
962        Mauritania    Africa  1962   44.248    1146757   1055.896036

In [39]:
df.nunique()# gives the count of unique values in the dataset

country       142
continent       5
year           12
lifeExp      1626
pop          1704
gdpPercap    1704
dtype: int64

In [45]:
df.groupby('year').nunique() # returns the count of values present in each of unique value

      country  continent  year  lifeExp  pop  gdpPercap
year
1952      142          5     1      142  142        142
1957      142          5     1      142  142        142
1962      142          5     1      141  142        142
1967      142          5     1      141  142        142
1972      142          5     1      142  142        142
1977      142          5     1      142  142        142
1982      142          5     1      142  142        142
1987      142          5     1      141  142        142
1992      142          5     1      141  142        142
1997      142          5     1      142  142        142
2002      142          5     1      142  142        142
2007      142          5     1      142  142        142

In [46]:
grouped = df.groupby(['continent'])[['lifeExp']].mean()
grouped  #returns the mean values of lifeexp associated by each continent

             lifeExp
continent
Africa     48.865330
Americas   64.658737
Asia       60.064903
Europe     71.903686
Oceania    74.326208

In [48]:
grouped = df.groupby(['year', 'continent'])[['lifeExp', 'gdpPercap']].mean()
grouped.head()

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650

In [58]:
grouped.columns

Index(['lifeExp', 'gdpPercap'], dtype='object')

In [59]:
grouped.index

MultiIndex(levels=[[1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002, 2007], ['Africa', 'Americas', 'Asia', 'Europe', 'Oceania']],
           codes=[[0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 9, 9, 9, 9, 9, 10, 10, 10, 10, 10, 11, 11, 11, 11, 11], [0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4, 0, 1, 2, 3, 4]],
           names=['year', 'continent'])

In [60]:
grouped.head()

                  lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650

In [61]:
type(grouped)

pandas.core.frame.DataFrame

In [63]:
grouped.reset_index().sample(10)

    year continent    lifeExp     gdpPercap
30  1982    Africa  51.592865   2481.592960
17  1967      Asia  54.663640   5971.173374
46  1997  Americas  71.150480   8889.300863
54  2002   Oceania  79.740000  26938.778040
4   1952   Oceania  69.255000  10298.085650
10  1962    Africa  43.319442   1598.078825
29  1977   Oceania  72.855000  17283.957605
16  1967  Americas  60.410920   5668.253496
18  1967    Europe  69.737600  10143.823757
51  2002  Americas  72.422040   9287.677107